# Активируем виртуальное окружение первого из трёх созданных проектов
# и устанавливаем в него модуль requests используя pip.
# Проверяем установку выводом списка модулей в консоль.
# Сохраняем список в файл, проверяем результат и выходим из окружения.
# Активируем виртуальное окружение второго из трёх созданных проектов
# и устанавливаем в него модуль flask используя pip.
# Проверяем установку выводом списка модулей в консоль.
# Сохраняем список в файл и выходим из окружения.
# Активируем третье виртуальное окружение.
# Устанавливаем в него модули из первого и второго проекта используя
# ранее сохранённые в файлы списки модулей.
# Проверяем установку выводом списка модулей в консоль.

print('task completed')
