# Работаем в командной строке (терминале ОС).
# Создайте каталог для проекта first_project и разверните виртуальное
# окружение Python в папке venv внутри каталога.
# Создайте третий каталог проекта project_new и разверните
# виртуальное окружение Python в папке venv_new внутри каталога.
# Для каждого проекта последовательно активируйте и деактивируйте виртуальное окружение.

print('task completed')
