# Доработаем задачи 3 и 4. Создайте класс проекта, который имеет следующие методы:
# - загрузка данных (функция из задания 4);
# - вход в систему - требует указать имя и id пользователя;
#   для проверки наличия пользователя в множестве используйте
#   магический метод проверки на равенство пользователей;
#   если такого пользователя нет, вызывайте исключение доступа;
#   а если пользователь есть, получите его уровень из множества пользователей;
# - добавление пользователя; если уровень пользователя меньше, чем ваш уровень,
#   вызывайте исключение уровня доступа.



