# Напишите функцию, которая открывает на чтение созданные в прошлых задачах файлы с числами и именами.
# Перемножьте пары чисел. В новый файл сохраните имя и произведение:
# - если результат умножения отрицательный, сохраните имя записанное строчными буквами
# и произведение по модулю;
# - если результат умножения положительный, сохраните имя прописными буквами
# и произведение округлённое до целого.
# В результирующем файле должно быть столько же строк, сколько в более длинном файле.
# При достижении конца более короткого файла, возвращайтесь в его начало.

with open('lesson7_task1.txt', 'r', encoding='utf-8') as f1, \
    open('lesson7_task2.txt', 'r', encoding='utf-8') as f2, \
        open('lesson7_task3.txt', 'a', encoding='utf-8') as f3:
    print(list(f1))
