# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

number = 1 # неизменяемый тип данных
bool = False # неизменяемый тип данных
float = 2.5 # неизменяемый тип данных
str = "hello" # неизменяемый тип данных
list = list()

print(type(number))
print(type(bool))
print(type(float))
print(type(str))
print(type(list))
