# Создайте модуль с функцией внутри.
# Функция принимает на вход три целых числа: нижнюю и верхнюю границу и количество попыток.
# Внутри генерируется случайное число в указанных границах и пользователь должен угадать 
# его за заданное число попыток.
# Функция выводит подсказки “больше” и “меньше”.
# Если число угадано, возвращается истина, а если попытки исчерпаны - ложь.

from random import randint


def guess_num(lower, upper, attempts):
    num = randint(lower, upper)
    # два варианта оформления формата
    print(f'Угадай число от {lower} до {upper}:\n')
    # print('Угадай число от {0} до {1}:\n'.format(lower, upper))

    count = 0
    while attempts > 0:
        attempt = int(input('Введите число: '))
        attempts -= 1
        count += 1
        if attempt < num:
            print('Загадано число больше')
        if attempt > num:
            print('Загадано число меньше')
        if attempt == num:
            print(f'Победа! Угадал за {count} попыток.')
            break
    else:
        print('Не угадал! Попытки исчерпаны.')


if __name__ == '__main__':
    pass
