# Пользователь вводит строку из четырёх или более целых чисел, разделённых символом “/”.
# Сформируйте словарь, где:
# - второе и третье число являются ключами;
# - первое число является значением для первого ключа;
# - четвертое и все возможные последующие числа хранятся в кортеже как значения второго ключа.

dct = {}
data = input('Введите числа через "/": ').split('/')
dct[data[1]] = data[0]
dct[data[2]] = data[3:]
print(dct)

new_dct = {data[1]: data[0], data[2]: [data[3:]]}
print(new_dct)

a, b, c, *d = input('Введите числа через "/": ').split('/')
print(result := {b: a, c: d})
